//Веб-сервис===================================

// Это программа которая организовывает взаимодействует между сайтами(информация из одного портала передаеться на другой портал) используя XML и  JSON при помощи  SOAP протокола или Rest-архитектурный стиль.
//
//SOAP - протокол обмена произвольными сообщениями в формате XML(состоти из XCD - это XML файл. WSDL - описывает структуру веб-сервиса )
// Rest-архитектурный стиль, позволяет записывать инф. в более удобном формате и который занимает меньше места и повышает производительность нашей систем.С помощью его описываем структуру передачи информации у веб-сервисов
//RESTfull - характеристики веб-сервисов.Это вебсервис который отвечает требованиям Rest
//Разница меду архитектурным стилем и протоколам - к первому не применяеться жесткие правила и нет  WSDL
//  использует JSON

//Отличия: Rest исользует такие форматы HTML, XML, JSON и только текстовые форматы, работает  только с HTTP и HTTPS а SOAP с многими протоколами и больше возможностей по безопасностей.