// AJAX==========================================================

// AJAX позволяет обновлять веб-страницы асинхронно, негласно обмениваясь данными с веб-сервером. Это означает, что можно обновлять части веб-страницы без перезагрузки всей страницы.

// Считывать данные с веб-сервера - после загрузки страницы
// Обновить веб-страницу без перезагрузки страницы
// Отправка данных на веб-сервер - в фоновом режиме
// Приложения AJAX могут использовать XML для передачи данных, но не менее распространено перенос данных в виде обычного текста или текста JSON.

// XMLHttpRequestОбъект может быть использован для обмена данными с веб - сервером за кулисами. Это означает, что можно обновлять части веб-страницы без перезагрузки всей страницы